---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarInvalidDiameterRemoved
source: html/da34a55a-b12f-6c78-135e-b50544f81e55.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RebarFailures.RebarInvalidDiameterRemoved Property

Invalid RebarBarType was removed on upgrade.

## Syntax (C#)
```csharp
public static FailureDefinitionId RebarInvalidDiameterRemoved { get; }
```